# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. 
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка; 
# F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков. 

# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; 
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. 

# Напишите программу, которая вычисляет стоимость введенного пользователем слова. 
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, 
# либо только русские буквы.

# *Пример:*
# ноутбук
#     12

d = {}
d['A'] = d['E'] = d['I'] = d['O'] = d['U'] = d['L'] = d['N'] = d['S'] = d['T'] = d['R'] ='1'
d['D'] = d['G'] ='2'
d['B'] = d['C'] = d['M'] = d['P'] ='3'
d['F'] = d['H'] = d['V'] = d['W'] = d['Y'] ='4'
d['K'] ='5'
d['J'] = d['X'] ='8'
d['Z'] = d['Q'] ='10'


d['А'] = d['В'] = d['Е'] = d['И'] = d['Н'] = d['О'] = d['Р'] = d['С'] = d['Т'] ='1'
d['Д'] = d['К'] = d['Л'] = d['М'] = d['П'] = d['У'] ='2'
d['Б'] = d['Г'] = d['Ё'] = d['Ь'] = d['Я'] ='3'
d['Й'] = d['Ы'] ='4'
d['Ж'] = d['З'] = d['Х'] = d['Ц'] = d['Ч'] ='5'
d['Ш'] = d['Э'] = d['Ю'] ='8'
d['Ф'] = d['Щ'] = d['Ъ'] ='10'


x = input('Введите слово: ')
x_2 = x.upper()
list(x_2)

m = 0

for i in x_2:
    m += int(d[i])    # m += (count := int(d[i]))

print (m)

